#1. ЗАДАЧА «ПОСЛЕДНЯЯ ЦИФРА ЧИСЛА»
#Дано натуральное число. Выведите его последнюю цифру.

n = int(input('Дано натуральное число = '))
k = n%10
print('',k)
